# WatchedLinkMoved Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..WatchedLinkMoved Property
BuiltInFailures..::..LinkFailures Class See Also
---
Monitored Link moved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WatchedLinkMoved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WatchedLinkMoved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WatchedLinkMoved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace